<template>
  <div>
    <div class="p-10 pl-[5vw] pr-[15vw] grid grid-cols-2 justify-items-center">
      <div name="image" class="p-[1vw]">
        <img
          src="/public/photo_2025-03-16_14-14-39.jpg"
          alt="my_photo"
          class="w-lg rounded-[2vw] w-auto h-auto"
        />
      </div>
      <div name="block_about_me" class="text-2xl">
        <h2 name="my_name" class="text-[3vw] flex justify-start">TIMONIN KIRILL</h2>
        <div name="about_me" class="pt-[2vw]">
          <p class="text-[#D3D3D3] p-[1vw]">
            Меня зовут Тимонин Кирилл, мне 18 лет, и я являюсь middle frontend разработчиком с
            глубокими знаниями в области веб-разработки. Образование я получил как специалист по
            кибербезопасности, что позволяет мне учитывать важные аспекты безопасности на всех
            этапах разработки. Мой опыт охватывает работу с современными фреймворками и
            библиотеками, включая Vue.js, и я стремлюсь создавать качественные и безопасные
            веб-приложения, соблюдая лучшие практики разработки. Я активно развиваюсь в своей
            профессиональной сфере, постоянно совершенствуя навыки и стремясь к внедрению
            инновационных решений в проекты. Моя цель — работать в команде профессионалов, где я
            смогу не только применить свои знания, но и учиться новым подходам в области frontend
            разработки.
          </p>
        </div>
      </div>
    </div>
  </div>
</template>
